{
  "common": {
    "name": "wallpanel",
    "version": "0.3.10",
    "news": {
      "0.3.10": {
        "en": "update dependencies\nupdate to new React library for UI",
        "de": "Abhängigkeiten aktualisieren\nUpdate auf neue React-Bibliothek für UI",
        "ru": "обновление зависимостей\nобновление до новой библиотеки React для пользовательского интерфейса",
        "pt": "actualizar as dependências\nactualização da nova biblioteca React para a UI",
        "nl": "afhankelijkheden bijwerken\nupdate naar nieuwe React-bibliotheek voor UI",
        "fr": "mise à jour des dépendances\nmise à jour vers la nouvelle bibliothèque React pour l'interface utilisateur",
        "it": "mise à jour des dépendances\nmise à jour vers la nouvelle bibliothèque React pour l'interface utilisateur",
        "es": "actualizar dependencias\nactualización a la nueva biblioteca React para UI",
        "pl": "aktualizować zależności\naktualizacja do nowej biblioteki React dla UI",
        "uk": "оновлення залежностей\nоновлення до нової бібліотеки React для UI",
        "zh-cn": "更新依赖性\n更新到用于UI的新React库"
      },
      "0.3.9": {
        "en": "dependencies updated \nMoved global variable to constructor",
        "de": "Abhängigkeiten aktualisiert \nGlobale Variablen in den Konstruktor verschoben",
        "ru": "обновленные зависимости \nГлобальные переменные перенесены в конструктор",
        "pt": "dependências actualizadas \nVariáveis globais movidas para construtor",
        "nl": "afhankelijkheden bijgewerkt \nGlobale variabelen verplaatst naar constructor",
        "fr": "Dépendances mises à jour \nVariables globales déplacées dans le constructeur",
        "it": "dipendenze aggiornate \nVariabili globali spostate nel costruttore",
        "es": "dependencias actualizadas \nVariables globales trasladadas al constructor",
        "pl": "aktualizacje zależności \nZmienne globalne przeniesione do konstruktora",
        "zh-cn": "更新了依赖关系 \n全局变量移入构造函数"
      },
      "0.3.8": {
        "en": "removed the play Store Link and added the GitHub Link to the new version and add a Warning for the Installer from GitHub.\noptimized the code\ndepandencies updated\nLeave the device switched off when creating Problem solved",
        "de": "entfernte den Play Store Link und fügte den GitHub Link zur neuen Version hinzu und füge eine Warnung für den Installer von GitHub hinzu.\noptimiert den code\ndepanden aktualisiert\nLassen Sie das Gerät ausgeschaltet, wenn das Problem gelöst wird",
        "ru": "удалили play Store Link и добавил GitHub Link в новую версию и добавить Предупреждение для установщика из GitHub.\nоптимизирован код\nобновлённые депандеции\nОставьте устройство выключается при создании проблемы решена",
        "pt": "removeu a play Store Link e adicionou o GitHub Link para a nova versão e adicione um aviso para o instalador do GitHub.\notimizado o código\ndepandencies atualizado\nDeixe o dispositivo desligado ao criar problema resolvido",
        "nl": "verwijderde het toneelstuk en voegde de GitHub Link toe aan de nieuwe versie en voegde een waarschuwing toe voor de Installer van GitHub.\nde code is optimistisch\nvertaling:\nLaat het apparaat uitschakelen als het probleem opgelost is",
        "fr": "a supprimé le jeu Store Link et ajouté le lien GitHub à la nouvelle version et ajouter un avertissement pour l'installateur de GitHub.\noptimisé le code\nmises à jour\nLaisser l'appareil éteint lors de la création du problème résolu",
        "it": "rimosso il play Store Link e aggiunto il GitHub Link alla nuova versione e aggiungere un avviso per l'installatore da GitHub.\nottimizzato il codice\ndeprezzamento aggiornato\nLasciare il dispositivo spento quando si crea Problema risolto",
        "es": "retirar el juego Store Link y agregar el GitHub Link a la nueva versión y añadir un Aviso para el Installer de GitHub.\noptimizado el código\ninformes actualizados\nDeja el dispositivo apagado al crear Problema resuelto",
        "pl": "usunął grę Store Link i dodał GitHub Link do nowej wersji i dodał Warning for the Installer from GitHub.\noptymizował kod\ndepanda\nUrządzenie zmieniło się, gdy tworzenie problemu rozwinęło się",
        "zh-cn": "删除了Se Store的链接,并增加了GitHub链接到新版本,并为GitHub的Installer增添了警告。.\n完善守则\n最新资料\n装置在创建问题解决时退出"
      },
      "0.3.7": {
        "en": "Node version support set to >= v15.x.x because of new features of Node.js that are needed.\nfixed mqtt topic Display Direction",
        "de": "Node-Versionsunterstützung auf >= v15.x.x festgelegt, da neue Funktionen von Node.js benötigt werden.\nAnzeigerichtung des mqtt-Themas behoben",
        "ru": "Поддержка версии Node установлена на >= v15.x.x из-за новых необходимых функций Node.js.\nфиксированная тема mqtt Display Direction",
        "pt": "Suporte à versão do nó definido como >= v15.x.x devido aos novos recursos do Node.js que são necessários.\ndireção de exibição do tópico mqtt fixo",
        "nl": "Ondersteuning voor node-versies ingesteld op >= v15.x.x vanwege nieuwe functies van Node.js die nodig zijn.\nvast mqtt-onderwerp Weergaverichting",
        "fr": "La prise en charge de la version de nœud est définie sur >= v15.x.x en raison des nouvelles fonctionnalités de Node.js qui sont nécessaires.\nsujet mqtt fixe Direction d'affichage",
        "it": "Supporto della versione del nodo impostato su >= v15.x.x a causa delle nuove funzionalità di Node.js necessarie.\nargomento mqtt fisso Direzione di visualizzazione",
        "es": "La compatibilidad con la versión de nodo se establece en >= v15.x.x debido a las nuevas funciones de Node.js que se necesitan.\ndirección de visualización de tema mqtt fijo",
        "pl": "Obsługa wersji węzła ustawiona na >= v15.x.x ze względu na nowe funkcje Node.js, które są potrzebne.\nnaprawiono temat mqtt Kierunek wyświetlania",
        "zh-cn": "由于需要 Node.js 的新功能，节点版本支持设置为 >= v15.x.x。\n固定 mqtt 主题显示方向"
      },
      "0.3.6": {
        "en": "preparation for release in Iobroker Repo. Adapter-Check issues processed",
        "de": "Vorbereitung zur Veröffentlichung in Iobroker Repo. Adapter-Check-Probleme verarbeitet",
        "ru": "подготовка к выпуску в Iobroker Repo. Проблемы с проверкой адаптера обработаны",
        "pt": "preparação para lançamento no Iobroker Repo. Problemas de verificação de adaptador processados",
        "nl": "voorbereiding voor release in Iobroker Repo. Problemen met adaptercontrole verwerkt",
        "fr": "préparation pour la libération dans Iobroker Repo. Problèmes d'Adapter-Check traités",
        "it": "preparazione per il rilascio in Iobroker Repo. Problemi di Adapter-Check elaborati",
        "es": "preparación para el lanzamiento en Iobroker Repo. Problemas de verificación del adaptador procesados",
        "pl": "przygotowania do wydania w Iobroker Repo. Przetworzono problemy ze sprawdzeniem karty",
        "zh-cn": "准备在 Iobroker Repo 中发布。已处理的适配器检查问题"
      },
      "0.3.5": {
        "en": "update Changelog and fixed type issues",
        "de": "Aktualisierung des Änderungsprotokolls und behobene Typprobleme",
        "ru": "обновить список изменений и проблемы с фиксированным типом",
        "pt": "atualizar o registro de alterações e problemas de tipo fixo",
        "nl": "update Changelog en problemen met opgeloste typen",
        "fr": "mettre à jour le journal des modifications et résoudre les problèmes de type",
        "it": "aggiornamento Changelog e problemi di tipo risolti",
        "es": "actualizar el registro de cambios y los problemas de tipo fijo",
        "pl": "aktualizacja dziennika zmian i naprawiono problemy z typami",
        "zh-cn": "更新变更日志并修复类型问题"
      },
      "0.3.4": {
        "en": "update Changlog an fixed type issues",
        "de": "Aktualisieren Sie Changlog und Probleme mit behobenen Typen",
        "ru": "обновить журнал изменений фиксированного типа",
        "pt": "atualizar Changlog um problema de tipo fixo",
        "nl": "update Changlog een vast type problemen",
        "fr": "mettre à jour Changlog et résoudre les problèmes de type",
        "it": "aggiornamento di Changlog e problemi di tipo fisso",
        "es": "actualizar Changlog y problemas de tipo fijo",
        "pl": "zaktualizuj Changloga naprawiono problemy z typem",
        "zh-cn": "更新 Changlog 一个固定类型问题"
      }
    },
    "titleLang": {
      "en": "Wallpanel",
      "de": "Wallpanel",
      "ru": "Wallpanel",
      "pt": "Wallpanel",
      "nl": "Wallpanel",
      "fr": "Wallpanel",
      "it": "Wallpanel",
      "es": "Wallpanel",
      "pl": "Wallpanel",
      "zh-cn": "Wallpanel"
    },
    "desc": {
      "en": "Wallpanel is a slim Android browser that still provides some information from the tablet via Http and Mqtt.",
      "de": "Wallpanel ist ein schlanker Android Browser, der noch ein paar Informationen vom Tablet per Http und Mqtt zur Verfügung stellt.",
      "ru": "Wallpanel - это строгий браузер Android, который все еще предоставляет некоторую информацию о планшете через Http и Mqtt.",
      "pt": "Wallpanel é um navegador Android slim que ainda fornece algumas informações da mesa via Http e Mqtt.",
      "nl": "Wallpanel is een slim Android browser die nog steeds enkele informatie van de tablet via Http en Mqtt biedt.",
      "fr": "Wallpanel est un navigateur Android léger qui encore fournit quelques informations de la tablette via Http et Mqtt.",
      "it": "Wallpanel è un browser Android leggero che ancora fornisce qualche informazione dalla tablet via Http e Mqtt.",
      "es": "Wallpanel es un navegador Android ligera que aún proporciona algunas informaciones de la tablet via Http y Mqtt.",
      "pl": "Wallpanel jest prosty przeglądarka Android, który nadal dostarcza niektóre informacje o tabletce za pośrednictwem Http i Mqtt.",
      "zh-cn": "Wallpanel 是一个轻量级的 Android 浏览器，它仍然提供了一些信息来自平板的 Http 和 Mqtt。"
    },
    "authors": [
      "xXBJXx <issi.dev.iobroker@gmail.com>"
    ],
    "keywords": [
      "Wallpanel",
      "browser",
      "Tablet"
    ],
    "license": "MIT",
    "platform": "Javascript/Node.js",
    "main": "build/main.js",
    "icon": "wallpanel.png",
    "enabled": true,
    "extIcon": "https://raw.githubusercontent.com/xXBJXx/ioBroker.wallpanel/main/admin/wallpanel.png",
    "readme": "https://github.com/xXBJXx/ioBroker.wallpanel/blob/main/README.md",
    "loglevel": "info",
    "mode": "daemon",
    "type": "hardware",
    "compact": true,
    "connectionType": "local",
    "dataSource": "poll",
    "materialize": true,
    "eraseOnUpload": true,
    "messagebox": true,
    "plugins": {
      "sentry": {
        "dsn": "https://59d55ede4d0c4cdbba1bc0538bc5f5ea@o384969.ingest.sentry.io/5408319"
      }
    },
    "dependencies": [
      {
        "js-controller": ">=3.3.18"
      }
    ],
    "globalDependencies": [
      {
        "admin": ">=5.2.1"
      }
    ],
    "messages": [
      {
        "condition": {
          "operand": "and",
          "rules": [
            "oldVersion<0.2.0-0.0",
            "newVersion>=0.3.0"
          ]
        },
        "title": {
          "en": "Important notice!",
          "de": "Wichtiger Hinweis!",
          "ru": "Важное замечание!",
          "pt": "Notícia importante!",
          "nl": "Belangrijke mededeling!",
          "fr": "Avis important!",
          "it": "Avviso IMPORTANTE!",
          "es": "Noticia importante!",
          "pl": "Ważna uwaga!",
          "zh-cn": "重要通知!"
        },
        "text": {
          "en": "The new UI is not fully compatible with the old version.\nPlease delete your old wallpanel instance or the tablets that were configured before installing / updating the new UI, otherwise errors may occur.",
          "de": "Die Neue UI ist nicht ganz kompatibel mit der alten Version.\nBitte löscht vor der Installation / Update der neuen UI eure alte Wallpanel Instanz oder die Tablets, die konfiguriert wurden, sonst kann es zu Fehlern kommen.",
          "ru": "Новый пользовательский интерфейс не полностью совместим со старой версией.\nПожалуйста, удалите старый экземпляр настенной панели или планшеты, которые были настроены перед установкой / обновлением нового пользовательского интерфейса, иначе могут возникнуть ошибки.",
          "pt": "A nova IU não é totalmente compatível com a versão antiga.\nFavor apagar a sua antiga instância do painel de parede ou as pastilhas que foram configuradas antes de instalar / actualizar a nova IU, caso contrário podem ocorrer erros.",
          "nl": "De nieuwe UI is niet volledig compatibel met de oude versie.\nVerwijder a.u.b. uw oude wandpaneel instantie of de tablets die geconfigureerd waren voordat u de nieuwe UI installeert/bijwerkt, anders kunnen er fouten optreden.",
          "fr": "La nouvelle UI n'est pas entièrement compatible avec l'ancienne version.\nAvant d'installer / de mettre à jour la nouvelle UI, veuillez supprimer votre ancienne instance de Wallpanel ou les tablettes qui ont été configurées, sinon des erreurs peuvent se produire.",
          "it": "La nuova interfaccia utente non è completamente compatibile con la vecchia versione.\nSi prega di cancellare la vecchia istanza del pannello a parete o i tablet configurati prima di installare/aggiornare la nuova interfaccia utente, altrimenti potrebbero verificarsi degli errori.",
          "es": "La nueva interfaz de usuario no es totalmente compatible con la versión antigua.\nPor favor, elimine su antigua instancia de panel de pared o las tabletas que fueron configuradas antes de instalar / actualizar la nueva interfaz de usuario, de lo contrario pueden producirse errores.",
          "pl": "Nowy interfejs użytkownika nie jest w pełni kompatybilny ze starą wersją.\nPrzed zainstalowaniem/aktualizacją nowego interfejsu użytkownika należy usunąć starą instancję panelu ściennego lub tablety, które zostały skonfigurowane, w przeciwnym razie mogą wystąpić błędy.",
          "zh-cn": "新的用户界面与旧版本不完全兼容。\n在安装/更新新的用户界面之前，请删除你的旧墙板实例或已配置的平板电脑，否则可能会出现错误。"
        },
        "level": "warn",
        "buttons": [
          "agree",
          "cancel"
        ]
      }
    ]
  },
  "native": {
    "interval": 30,
    "devices": [],
    "enabledMqtt": false,
    "mqttInstance": "mqtt.0",
    "mqttInstalled": false
  },
  "objects": [],
  "instanceObjects": [
    {
      "_id": "info",
      "type": "channel",
      "common": {
        "name": "Information"
      },
      "native": {}
    },
    {
      "_id": "info.connection",
      "type": "state",
      "common": {
        "role": "indicator.connected",
        "name": "Device or service connected",
        "type": "boolean",
        "read": true,
        "write": false,
        "def": false
      },
      "native": {}
    }
  ]
}
